neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32H5.c

#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include <math.h>
#include <time.h>

#include "soc.h"

#include "DMA/DMA.h"

#include "NeonRTOS.h"

#ifdef STM32H5

#include "DMA_STM32_Index.h"

#include "DMA_STM32.h"

//#include "CAN/Device/STM32/CAN_STM32.h"
#include "I2C/Device/STM32/I2C_Master_STM32.h"
#include "SPI/Device/STM32/SPI_Master_STM32.h"
#include "UART/Device/STM32/UART_STM32.h"

#define DMA_CHANNEL_LOCK(channel_index) if (NeonRTOS_LockObjLock(&DMA_Channel_Mutex[(channel_index)], DMA_WAIT_ALLOCATED_TIMEOUT) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }
#define DMA_CHANNEL_UNLOCK(channel_index) if (NeonRTOS_LockObjUnlock(&DMA_Channel_Mutex[(channel_index)]) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }

static const hwDMA_Channel_Index UART_DMA_Channel_Map[hwUART_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined (UART1_BASE) || defined(USART1_BASE)
    {hwDMA_Channel_Index_0, hwDMA_Channel_Index_1},
#endif
#if defined (UART2_BASE) || defined(USART2_BASE)
    {hwDMA_Channel_Index_2, hwDMA_Channel_Index_3},
#endif
#if defined (UART3_BASE) || defined(USART3_BASE)
    {hwDMA_Channel_Index_4, hwDMA_Channel_Index_5},
#endif
#if defined (UART4_BASE) || defined(USART4_BASE)
    {hwDMA_Channel_Index_6, hwDMA_Channel_Index_7},
#endif
#if defined (UART5_BASE) || defined(USART5_BASE)
    {hwDMA_Channel_Index_8, hwDMA_Channel_Index_9},
#endif
#if defined (UART6_BASE) || defined(USART6_BASE)
    {hwDMA_Channel_Index_10, hwDMA_Channel_Index_11},
#endif
#if defined (UART7_BASE) || defined(USART7_BASE)
    {hwDMA_Channel_Index_12, hwDMA_Channel_Index_13},
#endif
#if defined (UART8_BASE) || defined(USART8_BASE)
    {hwDMA_Channel_Index_14, hwDMA_Channel_Index_15},
#endif
#if defined (UART9_BASE) || defined(USART9_BASE)
    {hwDMA_Channel_Index_0, hwDMA_Channel_Index_1},
#endif
#if defined (UART10_BASE) || defined(USART10_BASE)
    {hwDMA_Channel_Index_2, hwDMA_Channel_Index_3},
#endif
#if defined (UART11_BASE) || defined(USART11_BASE)
    {hwDMA_Channel_Index_4, hwDMA_Channel_Index_5},
#endif
#if defined (UART12_BASE) || defined(USART12_BASE)
    {hwDMA_Channel_Index_6, hwDMA_Channel_Index_7},
#endif
#if defined (LPUART1_BASE)
    {hwDMA_Channel_Index_8, hwDMA_Channel_Index_9},
#endif
};

static const hwDMA_Channel_Index SPI_DMA_Channel_Map[hwSPI_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined(SPI1_BASE)
    {hwDMA_Channel_Index_0, hwDMA_Channel_Index_1},
#endif
#if defined(SPI2_BASE)
    {hwDMA_Channel_Index_2, hwDMA_Channel_Index_3},
#endif
#if defined(SPI3_BASE)
    {hwDMA_Channel_Index_4, hwDMA_Channel_Index_5},
#endif
#if defined(SPI4_BASE)
    {hwDMA_Channel_Index_6, hwDMA_Channel_Index_7},
#endif
#if defined(SPI5_BASE)
    {hwDMA_Channel_Index_8, hwDMA_Channel_Index_9},
#endif
#if defined(SPI6_BASE)
    {hwDMA_Channel_Index_10, hwDMA_Channel_Index_11},
#endif
};

static const hwDMA_Channel_Index I2C_DMA_Channel_Map[hwI2C_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined(I2C1_BASE)
    {hwDMA_Channel_Index_0, hwDMA_Channel_Index_1},
#endif
#if defined(I2C2_BASE)
    {hwDMA_Channel_Index_2, hwDMA_Channel_Index_3},
#endif
#if defined(I2C3_BASE)
    {hwDMA_Channel_Index_4, hwDMA_Channel_Index_5},
#endif
#if defined(I2C4_BASE)
    {hwDMA_Channel_Index_6, hwDMA_Channel_Index_7},
#endif
};

DMA_TypeDef * DMA_Map_Soc_Base(hwDMA_Channel_Index index)
{
    switch(index)
    {
#if defined (GPDMA1_BASE)
#if defined (GPDMA1_Channel0)
        case hwDMA_Channel_Index_0:
#endif
#if defined (GPDMA1_Channel1)
        case hwDMA_Channel_Index_1:
#endif
#if defined (GPDMA1_Channel2)
        case hwDMA_Channel_Index_2:
#endif
#if defined (GPDMA1_Channel3)
        case hwDMA_Channel_Index_3:
#endif
#if defined (GPDMA1_Channel4)
        case hwDMA_Channel_Index_4:
#endif
#if defined (GPDMA1_Channel5)
        case hwDMA_Channel_Index_5:
#endif
#if defined (GPDMA1_Channel6)
        case hwDMA_Channel_Index_6:
#endif
#if defined (GPDMA1_Channel7)
        case hwDMA_Channel_Index_7:
#endif
                return GPDMA1;
#endif //GPDMA1_BASE
#if defined (GPDMA2_BASE)
#if defined (GPDMA2_Channel0)
        case hwDMA_Channel_Index_8:
#endif
#if defined (GPDMA2_Channel1)
        case hwDMA_Channel_Index_9:
#endif
#if defined (GPDMA2_Channel2)
        case hwDMA_Channel_Index_10:
#endif
#if defined (GPDMA2_Channel3)
        case hwDMA_Channel_Index_11:
#endif
#if defined (GPDMA2_Channel4)
        case hwDMA_Channel_Index_12:
#endif
#if defined (GPDMA2_Channel5)
        case hwDMA_Channel_Index_13:
#endif
#if defined (GPDMA2_Channel6)
        case hwDMA_Channel_Index_14:
#endif
#if defined (GPDMA2_Channel7)
        case hwDMA_Channel_Index_15:
#endif
                return GPDMA2;
#endif //GPDMA2_BASE
        default:
                break;
    }
    return NULL;
}

DMA_Channel_TypeDef * DMA_Map_Soc_Channel_Base(hwDMA_Channel_Index index)
{
    switch(index)
    {
#if defined (GPDMA1_BASE)
#if defined (GPDMA1_Channel0)
        case hwDMA_Channel_Index_0: return GPDMA1_Channel0;
#endif
#if defined (GPDMA1_Channel1)
        case hwDMA_Channel_Index_1: return GPDMA1_Channel1;
#endif
#if defined (GPDMA1_Channel2)
        case hwDMA_Channel_Index_2: return GPDMA1_Channel2;
#endif
#if defined (GPDMA1_Channel3)
        case hwDMA_Channel_Index_3: return GPDMA1_Channel3;
#endif
#if defined (GPDMA1_Channel4)
        case hwDMA_Channel_Index_4: return GPDMA1_Channel4;
#endif
#if defined (GPDMA1_Channel5)
        case hwDMA_Channel_Index_5: return GPDMA1_Channel5;
#endif
#if defined (GPDMA1_Channel6)
        case hwDMA_Channel_Index_6: return GPDMA1_Channel6;
#endif
#if defined (GPDMA1_Channel7)
        case hwDMA_Channel_Index_7: return GPDMA1_Channel7;
#endif
#endif // GPDMA1_BASE
#if defined (GPDMA2_BASE)
#if defined (GPDMA2_Channel0)
        case hwDMA_Channel_Index_8: return GPDMA2_Channel0;
#endif
#if defined (GPDMA2_Channel1)
        case hwDMA_Channel_Index_9: return GPDMA2_Channel1;
#endif
#if defined (GPDMA2_Channel2)
        case hwDMA_Channel_Index_10: return GPDMA2_Channel2;
#endif
#if defined (GPDMA2_Channel3)
        case hwDMA_Channel_Index_11: return GPDMA2_Channel3;
#endif
#if defined (GPDMA2_Channel4)
        case hwDMA_Channel_Index_12: return GPDMA2_Channel4;
#endif
#if defined (GPDMA2_Channel5)
        case hwDMA_Channel_Index_13: return GPDMA2_Channel5;
#endif
#if defined (GPDMA2_Channel6)
        case hwDMA_Channel_Index_14: return GPDMA2_Channel6;
#endif
#if defined (GPDMA2_Channel7)
        case hwDMA_Channel_Index_15: return GPDMA2_Channel7;
#endif
#endif // GPDMA2_BASE
        default: break;
    }
    return NULL;
}

