neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32H5.c
static void DMA_IRQ_Handler(hwDMA_Channel_Index index)
{
        if(index>=hwDMA_Channel_Index_MAX)
        {
                return;
        }

        HAL_DMA_IRQHandler(&g_dma[index]);
}

#if defined(GPDMA1_BASE)
#if defined(GPDMA1_Channel0)
void GPDMA1_Channel0_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_0); }
#endif
#if defined(GPDMA1_Channel1)
void GPDMA1_Channel1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_1); }
#endif
#if defined(GPDMA1_Channel2)
void GPDMA1_Channel2_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_2); }
#endif
#if defined(GPDMA1_Channel3)
void GPDMA1_Channel3_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_3); }
#endif
#if defined(GPDMA1_Channel4)
void GPDMA1_Channel4_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_4); }
#endif
#if defined(GPDMA1_Channel5)
void GPDMA1_Channel5_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_5); }
#endif
#if defined(GPDMA1_Channel6)
void GPDMA1_Channel6_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_6); }
#endif
#if defined(GPDMA1_Channel7)
void GPDMA1_Channel7_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_7); }
#endif
#endif // GPDMA1_BASE

#if defined(GPDMA2_BASE)
#if defined(GPDMA2_Channel0)
void GPDMA2_Channel0_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_8); }
#endif
#if defined(GPDMA2_Channel1)
void GPDMA2_Channel1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_9); }
#endif
#if defined(GPDMA2_Channel2)
void GPDMA2_Channel2_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_10); }
#endif
#if defined(GPDMA2_Channel3)
void GPDMA2_Channel3_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_11); }
#endif
#if defined(GPDMA2_Channel4)
void GPDMA2_Channel4_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_12); }
#endif
#if defined(GPDMA2_Channel5)
void GPDMA2_Channel5_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_13); }
#endif
#if defined(GPDMA2_Channel6)
void GPDMA2_Channel6_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_14); }
#endif
#if defined(GPDMA2_Channel7)
void GPDMA2_Channel7_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_15); }
#endif
#endif // GPDMA2_BASE

void DMA_Clock_Enable()
{
#if defined (GPDMA1_BASE)
         __HAL_RCC_GPDMA1_CLK_ENABLE();
#endif //GPDMA1_BASE

#if defined (GPDMA2_BASE)
         __HAL_RCC_GPDMA2_CLK_ENABLE();
#endif //GPDMA2_BASE

}

void DMA_Clock_Disable()
{
#if defined (GPDMA1_BASE)
        __HAL_RCC_GPDMA1_CLK_DISABLE();
#endif //GPDMA1_BASE

#if defined (GPDMA2_BASE)
         __HAL_RCC_GPDMA2_CLK_DISABLE();
#endif //GPDMA2_BASE
}

hwDMA_OpResult DMA_NVIC_Init(hwDMA_Channel_Index channel_index)
{
        if(channel_index>=hwDMA_Channel_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(DMA_Channel_Init_Status[channel_index]==true)
        {
                return hwDMA_OK;
        }

        switch(channel_index)
        {
#if defined(GPDMA1_BASE)
#if defined(GPDMA1_Channel0)
                case hwDMA_Channel_Index_0:
                        HAL_NVIC_SetPriority(GPDMA1_Channel0_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel0_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_SetPriority(GPDMA1_Channel1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel1_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel2)
                case hwDMA_Channel_Index_2:
                        HAL_NVIC_SetPriority(GPDMA1_Channel2_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel2_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel3)
                case hwDMA_Channel_Index_3:
                        HAL_NVIC_SetPriority(GPDMA1_Channel3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel3_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel4)
                case hwDMA_Channel_Index_4:
                        HAL_NVIC_SetPriority(GPDMA1_Channel4_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel4_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel5)
                case hwDMA_Channel_Index_5:
                        HAL_NVIC_SetPriority(GPDMA1_Channel5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel5_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel6)
                case hwDMA_Channel_Index_6:
                        HAL_NVIC_SetPriority(GPDMA1_Channel6_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel6_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel7)
                case hwDMA_Channel_Index_7:
                        HAL_NVIC_SetPriority(GPDMA1_Channel7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel7_IRQn);
                        break;
#endif
#endif // GPDMA1_BASE

#if defined(GPDMA2_BASE)
#if defined(GPDMA2_Channel0)
                case hwDMA_Channel_Index_8:
                        HAL_NVIC_SetPriority(GPDMA2_Channel0_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA2_Channel0_IRQn);
                        break;
#endif
#if defined(GPDMA2_Channel1)
                case hwDMA_Channel_Index_9:
                        HAL_NVIC_SetPriority(GPDMA2_Channel1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA2_Channel1_IRQn);
                        break;
#endif
#if defined(GPDMA2_Channel2)
                case hwDMA_Channel_Index_10:
                        HAL_NVIC_SetPriority(GPDMA2_Channel2_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA2_Channel2_IRQn);
                        break;
#endif
#if defined(GPDMA2_Channel3)
                case hwDMA_Channel_Index_11:
                        HAL_NVIC_SetPriority(GPDMA2_Channel3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA2_Channel3_IRQn);
                        break;
#endif
#if defined(GPDMA2_Channel4)
                case hwDMA_Channel_Index_12:
                        HAL_NVIC_SetPriority(GPDMA2_Channel4_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA2_Channel4_IRQn);
                        break;
#endif
#if defined(GPDMA2_Channel5)
                case hwDMA_Channel_Index_13:
                        HAL_NVIC_SetPriority(GPDMA2_Channel5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA2_Channel5_IRQn);
                        break;
#endif
#if defined(GPDMA2_Channel6)
                case hwDMA_Channel_Index_14:
                        HAL_NVIC_SetPriority(GPDMA2_Channel6_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA2_Channel6_IRQn);
                        break;
#endif
#if defined(GPDMA2_Channel7)
                case hwDMA_Channel_Index_15:
                        HAL_NVIC_SetPriority(GPDMA2_Channel7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA2_Channel7_IRQn);
                        break;
#endif
#endif // GPDMA2_BASE
        }

