neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32H5.c
                        switch (index)
                        {
#if defined (UART1_BASE)
                                case hwUART_Index_0:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_UART1_RX;
                                        break;
#endif
#if defined(USART1_BASE)
                                case hwUART_Index_0:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_USART1_RX;
                                        break;
#endif
#if defined (UART2_BASE)
                                case hwUART_Index_1:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_UART2_RX;
                                        break;
#endif
#if defined(USART2_BASE)
                                case hwUART_Index_1:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_USART2_RX;
                                        break;
#endif
#if defined (UART3_BASE)
                                case hwUART_Index_2:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_UART3_RX;
                                        break;
#endif
#if defined(USART3_BASE)
                                case hwUART_Index_2:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_USART3_RX;
                                        break;
#endif
#if defined (UART4_BASE)
                                case hwUART_Index_3:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_UART4_RX;
                                        break;
#endif
#if defined(USART4_BASE)
                                case hwUART_Index_3:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_USART4_RX;
                                        break;
#endif
#if defined (UART5_BASE)
                                case hwUART_Index_4:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_UART5_RX;
                                        break;
#endif
#if defined(USART5_BASE)
                                case hwUART_Index_4:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_USART5_RX;
                                        break;
#endif
#if defined (UART6_BASE)
                                case hwUART_Index_5:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_UART6_RX;
                                        break;
#endif
#if defined(USART6_BASE)
                                case hwUART_Index_5:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_USART6_RX;
                                        break;
#endif
#if defined (UART7_BASE)
                                case hwUART_Index_6:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_UART7_RX;
                                        break;
#endif
#if defined(USART7_BASE)
                                case hwUART_Index_6:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_USART7_RX;
                                        break;
#endif
#if defined (UART8_BASE)
                                case hwUART_Index_7:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_UART8_RX;
                                        break;
#endif
#if defined(USART8_BASE)
                                case hwUART_Index_7:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_USART8_RX;
                                        break;
#endif
#if defined (UART9_BASE)
                                case hwUART_Index_8:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_UART9_RX;
                                        break;
#endif
#if defined(USART9_BASE)
                                case hwUART_Index_8:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_USART9_RX;
                                        break;
#endif
#if defined (UART10_BASE)
                                case hwUART_Index_9:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_UART10_RX;
                                        break;
#endif
#if defined(USART10_BASE)
                                case hwUART_Index_9:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_USART10_RX;
                                        break;
#endif
#if defined (UART11_BASE)
                                case hwUART_Index_10:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_UART11_RX;
                                        break;
#endif
#if defined(USART11_BASE)
                                case hwUART_Index_10:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_USART11_RX;
                                        break;
#endif
#if defined (UART12_BASE)
                                case hwUART_Index_11:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_UART12_RX;
                                        break;
#endif
#if defined(USART12_BASE)
                                case hwUART_Index_11:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_USART12_RX;
                                        break;
#endif
#if defined(LPUART1_BASE)
                                case hwUART_Index_L1:
                                        g_dma[channel_index].Init.Request = GPDMA1_REQUEST_LPUART1_RX;
                                        break;
#endif
                        }
                        break;
        }

        if (HAL_DMA_Init(&g_dma[channel_index]) != HAL_OK)
        {
                return hwDMA_HwError;
        }

        switch (dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                        __HAL_LINKDMA(&g_uart[index], hdmatx, g_dma[channel_index]);
                        break;

                case hwDMA_Peripheral_Direction_RX:
                        __HAL_LINKDMA(&g_uart[index], hdmarx, g_dma[channel_index]);
                        break;
        }

